src/integration-test/resources/applicantIT/__files/test01_getApplicantErrands/mappings/api-byggr-read-errands.json

{
	"request": {
		"headers": {
			"Content-Type": {
				"equalTo": "text/xml;charset=UTF-8"
			}
		},
		"method": "POST",
		"bodyPatterns": [
			{
				"equalToXml": "<?xml version=\"1.0\" encoding=\"UTF-8\" ?><SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\"><SOAP-ENV:Header/><SOAP-ENV:Body><GetRelateradeArendenByPersOrgNrAndRole xmlns=\"www.tekis.se/ServiceContract\"><persOrgNr>19010203-1234</persOrgNr><statusfilter>Aktiv</statusfilter></GetRelateradeArendenByPersOrgNrAndRole></SOAP-ENV:Body></SOAP-ENV:Envelope>"
			}
		],
		"urlPath": "/api-byggr/endpoint"
	},
	"response": {
		"headers": {
			"Content-Type": "application/xml"
		},
		"bodyFileName": "test01_getApplicantErrands/responses/api-byggr-read-errands-response.xml",
		"status": 200
	},
	"name": "api-byggr-read-errands"
}
