src/integration-test/resources/fileIT/__files/test03_getFileForNonNumericId/mappings/api-byggr-get-document.json

{
	"name": "api-byggr-get-document",
	"request": {
		"method": "POST",
		"urlPath": "/api-byggr/endpoint",
		"headers": {
			"Content-Type": {
				"equalTo": "text/xml;charset=UTF-8"
			}
		},
        "bodyPatterns" : [{
          "equalToXml" : "<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?><SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\"><SOAP-ENV:Header/><SOAP-ENV:Body><GetDocument xmlns=\"www.tekis.se/ServiceContract\"><documentId>ABCABCABC</documentId><inkluderaFil>true</inkluderaFil></GetDocument></SOAP-ENV:Body></SOAP-ENV:Envelope>"
	    }]
	},
	"response": {
		"headers": {
			"Content-Type": "application/xml"
		},
		"status": 500,
		"bodyFileName": "test03_getFileForNonNumericId/responses/api-byggr-get-document-response.xml"
		}
	}
}