src/integration-test/resources/fileIT/__files/test01_getFile/mappings/api-byggr-get-document.json

{
	"request": {
		"headers": {
			"Content-Type": {
				"equalTo": "text/xml;charset=UTF-8"
			}
		},
		"method": "POST",
		"bodyPatterns": [
			{
				"equalToXml": "<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?><SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\"><SOAP-ENV:Header/><SOAP-ENV:Body><GetDocument xmlns=\"www.tekis.se/ServiceContract\"><documentId>123456789</documentId><inkluderaFil>true</inkluderaFil></GetDocument></SOAP-ENV:Body></SOAP-ENV:Envelope>"
			}
		],
		"urlPath": "/api-byggr/endpoint"
	},
	"response": {
		"headers": {
			"Content-Type": "application/xml"
		},
		"bodyFileName": "test01_getFile/responses/api-byggr-get-document-response.xml",
		"status": 200
	},
	"name": "api-byggr-get-document"
}
