src/integration-test/resources/neighborhoodNotificationIT/__files/test02_getNeighborhoodNotificationsWhenNoMatch/mappings/api-byggr-get-roles.json

{
	"request": {
		"headers": {"Content-Type": {"equalTo": "text/xml;charset=UTF-8"}},
		"method": "POST",
		"bodyPatterns": [{"equalToXml": "<?xml version=\"1.0\" encoding=\"UTF-8\" ?><SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\"><SOAP-ENV:Header/><SOAP-ENV:Body><GetRoller xmlns=\"www.tekis.se/ServiceContract\"><rollTyp>Intressent<\/rollTyp><statusfilter>Aktiv<\/statusfilter><\/GetRoller><\/SOAP-ENV:Body><\/SOAP-ENV:Envelope>"}],
		"urlPath": "/api-byggr/endpoint"
	},
	"response": {
		"headers": {"Content-Type": "application/xml"},
		"bodyFileName": "test02_getNeighborhoodNotificationsWhenNoMatch/responses/api-byggr-get-roles-response.xml",
		"status": 200
	},
	"name": "api-byggr-get-roles"
}
